Evalutation of best performing model:
[0.4365126928390712, 0.5964025568648436]
Best performing model chosen hyper-parameters index:
{'kernel_size1': 2, 'n_conv_1': 0, 'Dense': 0, 'Dropout': 2, 'n_conv': 0, 'lr': 0, 'filters': 0, 'filters_1': 3, 'filters_2': 2}
Summary of best model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_42 (Conv1D)           (None, 982, 50)           3850      
_________________________________________________________________
batch_normalization_68 (Batc (None, 982, 50)           200       
_________________________________________________________________
activation_85 (Activation)   (None, 982, 50)           0         
_________________________________________________________________
max_pooling1d_18 (MaxPooling (None, 16, 50)            0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 4)                 3204      
_________________________________________________________________
activation_86 (Activation)   (None, 4)                 0         
=================================================================
Total params: 7,254
Trainable params: 7,154
Non-trainable params: 100
_________________________________________________________________
