Evalutation of best performing model:
[0.5096629630390489, 0.5471978593903983]
Best performing model chosen hyper-parameters index:
{'kernel_size1': 1, 'n_conv_1': 3, 'Dense': 0, 'Dropout': 2, 'n_conv': 2, 'lr': 1, 'filters': 4, 'filters_1': 2, 'filters_2': 0}
Summary of best model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_24 (Conv1D)           (None, 986, 1000)         61000     
_________________________________________________________________
batch_normalization_38 (Batc (None, 986, 1000)         4000      
_________________________________________________________________
activation_49 (Activation)   (None, 986, 1000)         0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 972, 250)          3750250   
_________________________________________________________________
batch_normalization_39 (Batc (None, 972, 250)          1000      
_________________________________________________________________
activation_50 (Activation)   (None, 972, 250)          0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 960, 250)          812750    
_________________________________________________________________
batch_normalization_40 (Batc (None, 960, 250)          1000      
_________________________________________________________________
activation_51 (Activation)   (None, 960, 250)          0         
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 96, 250)           0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 24000)             0         
_________________________________________________________________
dense_26 (Dense)             (None, 50)                1200050   
_________________________________________________________________
batch_normalization_41 (Batc (None, 50)                200       
_________________________________________________________________
activation_52 (Activation)   (None, 50)                0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_27 (Dense)             (None, 50)                2550      
_________________________________________________________________
batch_normalization_42 (Batc (None, 50)                200       
_________________________________________________________________
activation_53 (Activation)   (None, 50)                0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 50)                2550      
_________________________________________________________________
batch_normalization_43 (Batc (None, 50)                200       
_________________________________________________________________
activation_54 (Activation)   (None, 50)                0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_29 (Dense)             (None, 4)                 204       
_________________________________________________________________
activation_55 (Activation)   (None, 4)                 0         
=================================================================
Total params: 5,835,954
Trainable params: 5,832,654
Non-trainable params: 3,300
_________________________________________________________________
