Evalutation of best performing model:
[0.4548069357648744, 0.5783340269897376]
Best performing model chosen hyper-parameters index:
{'kernel_size1': 0, 'n_conv_1': 0, 'Dense': 1, 'Dropout': 1, 'n_conv': 0, 'lr': 2, 'filters': 2, 'filters_1': 0, 'filters_2': 1}
Summary of best model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_65 (Conv1D)           (None, 988, 250)          13250     
_________________________________________________________________
batch_normalization_101 (Bat (None, 988, 250)          1000      
_________________________________________________________________
activation_134 (Activation)  (None, 988, 250)          0         
_________________________________________________________________
max_pooling1d_34 (MaxPooling (None, 32, 250)           0         
_________________________________________________________________
flatten_34 (Flatten)         (None, 8000)              0         
_________________________________________________________________
dense_70 (Dense)             (None, 4)                 32004     
_________________________________________________________________
activation_135 (Activation)  (None, 4)                 0         
=================================================================
Total params: 46,254
Trainable params: 45,754
Non-trainable params: 500
_________________________________________________________________
