Evalutation of best performing model:
[0.43884479498436535, 0.5833581069029075]
Best performing model chosen hyper-parameters index:
{'kernel_size1': 3, 'n_conv_1': 3, 'Dense': 1, 'Dropout': 1, 'n_conv': 0, 'lr': 2, 'filters': 0, 'filters_1': 0, 'filters_2': 2}
Summary of best model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_69 (Conv1D)           (None, 976, 50)           5050      
_________________________________________________________________
batch_normalization_124 (Bat (None, 976, 50)           200       
_________________________________________________________________
activation_159 (Activation)  (None, 976, 50)           0         
_________________________________________________________________
max_pooling1d_36 (MaxPooling (None, 16, 50)            0         
_________________________________________________________________
flatten_36 (Flatten)         (None, 800)               0         
_________________________________________________________________
dense_91 (Dense)             (None, 100)               80100     
_________________________________________________________________
batch_normalization_125 (Bat (None, 100)               400       
_________________________________________________________________
activation_160 (Activation)  (None, 100)               0         
_________________________________________________________________
dropout_56 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_92 (Dense)             (None, 100)               10100     
_________________________________________________________________
batch_normalization_126 (Bat (None, 100)               400       
_________________________________________________________________
activation_161 (Activation)  (None, 100)               0         
_________________________________________________________________
dropout_57 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_93 (Dense)             (None, 100)               10100     
_________________________________________________________________
batch_normalization_127 (Bat (None, 100)               400       
_________________________________________________________________
activation_162 (Activation)  (None, 100)               0         
_________________________________________________________________
dropout_58 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_94 (Dense)             (None, 4)                 404       
_________________________________________________________________
activation_163 (Activation)  (None, 4)                 0         
=================================================================
Total params: 107,154
Trainable params: 106,454
Non-trainable params: 700
_________________________________________________________________
